{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"return_sequences": false, "name": "lstm_1", "activity_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "recurrent_constraint": null, "implementation": 0, "return_state": false, "kernel_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "batch_input_shape": [null, null, 28], "go_backwards": false, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 1024, "recurrent_regularizer": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 1024, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_1", "n": 16, "trainable": true}}, {"class_name": "LSTM", "config": {"dropout": 0.0, "return_sequences": true, "name": "lstm_2", "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "return_state": false, "kernel_regularizer": null, "activation": "tanh", "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "unit_forget_bias": true, "use_bias": true, "go_backwards": false, "recurrent_regularizer": null, "trainable": true, "units": 1024, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "trainable": true, "units": 28, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}}}], "keras_version": "2.0.5", "backend": "tensorflow"}